import './home.scss';


export const Home = () => {
    
    return(
        <div className='home-wrapper'>
            <div className='start-wrapper'><h2>C<span>π</span>равочник</h2></div>
            <div className='subject-wrapper'>
                <div>
                    <h3><span>Математика</span> неисчерпаемая?</h3>
                    
                    <h4>Базовая <span>математика</span></h4>
                    <p><span>Д</span>аже базовая <span>математика</span> имеет очень большой потенциал в использовании и изучении ведь количество тех задач которые она <span>решает</span> почти безгранично</p>
                </div>
            </div>
            <div className='subject-wrapper'>
            <div>
                    <h3><span>Математика</span> полезная?</h3>
                    
                    <h4>Высшая <span>математика</span></h4>
                    <p><span>С</span> высшей же <span>математикой</span> можно расчитать площадь или же объем почти любого объекта, <span>а</span> так же проводить абсолютно любые расчеты в смежных науках таких как физика, химия, экономика и т.п.</p>
                </div>
            </div>
            <div className='subject-wrapper'>
            <div>
                    <h3><span>Математика</span> не точная?</h3>
                    <h4><span>Математическая</span> статистика</h4>
                    <p><span>Математическая</span> статистика может рассказать вам с каким шансом произойдет то или инное <span>событие</span> или же какой большой должна быть выборка для проведения качественных и <span>точных</span> иследований</p>
                </div>
            </div>
            <div className='subject-wrapper'>
            <div>
                    <h3><span>Математика</span> 0 или 1?</h3>
                    
                    <h4><span>Математическая</span> логика</h4>
                    <p><span>Математическая</span> логика по сути является своеобразным прородителем программирования и проектирования разнообразных <span>логических систем</span>  от самых маленьких чипов выполняющих не тривиальные задачи до <span>вычеслительных</span> монстров по типу полноценных процессоров которым подвластны <span>абсолютно любые вычисления</span></p>
                </div>
            </div>
        </div>
    )
}